load-testing/scenarios/moderate-load.yml
config:
  target: 'http://localhost:5000/api'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Ramp up"
    - duration: 300
      arrivalRate: 25
      name: "Moderate sustained load"
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  processor: "../scripts/processor.js"
  defaults:
    headers:
      'Content-Type': 'application/json'
  variables:
    testAgentEmail: "test.agent@transconnect.test"
    testPassword: "TestPassword123!"

scenarios:
  - name: "Concurrent Agent Operations"
    weight: 25
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "agent{{ $randomInt(1, 100) }}@test.com"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.agent.id"
              as: "agentId"
      - loop:
          - get:
              url: "/agents/{{ agentId }}/dashboard"
              headers:
                Authorization: "Bearer {{ authToken }}"
          - post:
              url: "/agents/activity"
              headers:
                Authorization: "Bearer {{ authToken }}"
              json:
                action: "heartbeat"
                location:
                  lat: "{{ $randomFloat(0.0, 1.0) }}"
                  lng: "{{ $randomFloat(32.0, 33.0) }}"
          - think: 5
        count: 10

  - name: "Heavy Booking Load"
    weight: 35
    flow:
      - post:
          url: "/auth/register"
          json:
            email: "customer{{ $randomInt(1, 10000) }}@test.com"
            password: "TestPass123!"
            name: "Test Customer {{ $randomInt(1, 1000) }}"
            phone: "+25677{{ $randomInt(1000000, 9999999) }}"
            role: "customer"
          capture:
            - json: "$.token"
              as: "customerToken"
            - json: "$.user.id"
              as: "customerId"
      - get:
          url: "/routes"
          qs:
            origin: "{{ $randomPick(['Kampala', 'Entebbe', 'Jinja', 'Mbarara']) }}"
            destination: "{{ $randomPick(['Kampala', 'Entebbe', 'Jinja', 'Mbarara']) }}"
            date: "{{ $futureDate() }}"
      - post:
          url: "/bookings"
          headers:
            Authorization: "Bearer {{ customerToken }}"
          json:
            routeId: "{{ $randomInt(1, 10) }}"
            seatNumber: "{{ $randomInt(1, 50) }}"
            passengerName: "Test Passenger"
            passengerPhone: "+25677{{ $randomInt(1000000, 9999999) }}"
          capture:
            - json: "$.id"
              as: "bookingId"
      - get:
          url: "/bookings/{{ bookingId }}"
          headers:
            Authorization: "Bearer {{ customerToken }}"

  - name: "Admin Operations Load"
    weight: 20
    flow:
      - get:
          url: "/agents/admin/all"
      - get:
          url: "/buses/admin/all"
      - get:
          url: "/bookings/admin/recent"
      - get:
          url: "/operators"

  - name: "Real-time Features Stress"
    weight: 20
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ testAgentEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - loop:
          - post:
              url: "/agents/activity"
              headers:
                Authorization: "Bearer {{ authToken }}"
              json:
                action: "heartbeat"
                timestamp: "{{ $timestamp() }}"
          - get:
              url: "/agents/online"
          - think: 2
        count: 30